docs/arkitektur/tilstander/NAV 90-00.08.approved.md
```mermaid
   stateDiagram
   [*]-->MottattType
   	MottattType --> AvventerJournalpostType
	AvventerJournalpostType --> AvventerPersondataType
	AvventerPersondataType --> KategoriseringType
	KategoriseringType --> AvventerFagsystem
    AvventerFagsystem --> AventerArenaOppgaveType
    AvventerFagsystem --> AventerDagpengerOppgaveType
    AventerArenaOppgaveType --> AvventerFerdigstillJournalpostType
    AventerDagpengerOppgaveType --> AvventerFerdigstillJournalpostType
	AvventerFerdigstillJournalpostType --> InnsendingFerdigstiltType
   InnsendingFerdigstiltType--> [*]    
```
